import React, { Component } from 'react';
import './List.css';

  class List extends Component {
    state = { names:["الأعمال بالنيات", "مراتب الدين", "أركان الإسلام", "مراحل الخلق", "النهي عن الابتداع في الدين", "البعد عن مواطن الشبهات", "الدين النصيحه", "حرمة دم المسلم وماله", "النهي عن كثرة السؤال والتشدد", "سبب إجابة الدعاء", "اترك ما شككت فيه", "الاشتغال بما يفيد", "من كمال الإيمان", "متى يهدر دم المسلم؟", "اكرام الضيف", "النهي عن الغضب", "الرفق بالحيوان", "الخلق الحسن", "الإيمان بالقضاء والقدر", "الحياء من الإيمان", "الاستقامه بالإسلام", "الطريق إلى الجنة", "جوامع الخير", "من فضل الله على الناس", "فضل الذكر", "كثرة طرق الخير", "تعريف البر والإثم", "السمع والطاعة", "بواب الخير", "الوقوف عند حدود الشرع", "الزهد في الدنيا", "لاضرر ولا ضرار", "البيّنة على المُدَّعي", "تغيير المنكر فريضة", "المسلم أخو المسلم", "قضاء حوائج المسلمين", "الترغيب في فعل الحسنات", "جزاء معادات الأولياء", "التجاوز عن الخطأ والنسيان", "كن في الدنيا كأنك غريب", "اتباع النبي صلى الله عليه وسلم", "سعة مغفرة الله"] }
    render() { 
        return ( 
        <div>
            <ul className='titles-list'>
                {this.state.names.map(n=><li key={n} className='title'>{n}</li>)} 
            </ul> 
        </div>);
    }
  }
   
  export default List;